[
  {
    "id": 1,
    "stage": "developmental",
    "severity": "major",
    "category": "structure",
    "location": "Chapter 1",
    "original_text": "00Scene FC After a comical chase around the room00",
    "description": "The manuscript contains structural placeholders and repetitive text blocks. The scene where Silvia puts the sweater on Angel Baby is written out in full detail, then followed by 'Scene' headers and a second, slightly different version of the same event.",
    "suggestion": "Remove the 'Scene' headers and consolidate the two versions of the sweater-dressing scene into one cohesive narrative sequence.",
    "bible_conflict": false
  },
  {
    "id": 2,
    "stage": "developmental",
    "severity": "major",
    "category": "pacing",
    "location": "Chapters 2 and 3",
    "original_text": "Angel Baby noticed something strange. She wasn't shivering.",
    "description": "The narrative arc is redundant across Chapters 2 and 3. In Chapter 2 (the Mall), Angel Baby realizes the sweater keeps her warm and makes her popular. In Chapter 3 (the Market), she has the exact same realization again. This causes the middle of the book to drag as the character learns the same lesson twice.",
    "suggestion": "Differentiate the chapters by giving them unique narrative goals. For example, Chapter 2 could focus on the 'social' benefit (people admiring her), while Chapter 3 focuses on the 'functional' benefit (playing in the snow). Alternatively, combine them into one 'Grand Outing' to tighten the pacing.",
    "bible_conflict": false
  },
  {
    "id": 3,
    "stage": "developmental",
    "severity": "major",
    "category": "plot",
    "location": "Chapter 2",
    "original_text": "Souuy Til.ia who was p,shing her",
    "description": "There is a significant character encoding/OCR error throughout Chapter 2. Names like 'Mommy Silvia' and 'Susana' are garbled into 'Souuy Til.ia' and 'T,sana,' and common words are filled with punctuation errors (e.g., 'uanage' instead of 'manage').",
    "suggestion": "Perform a comprehensive text cleanup to restore character names and standard English spelling to ensure readability.",
    "bible_conflict": false
  },
  {
    "id": 4,
    "stage": "developmental",
    "severity": "major",
    "category": "character arcs",
    "location": "Chapter 2",
    "original_text": "I'll stay grumpy forever. Or at least until this itchy, terrible, horrible sweater comes oﬀ.",
    "description": "Angel Baby's transition from 'hating the sweater' to 'accepting the sweater' happens too many times. She resolves to be grumpy, then immediately feels warm and happy, then resolves to be grumpy again. This 'yo-yo' effect makes the character's internal growth feel inconsistent.",
    "suggestion": "Allow the transition to be more linear. Let her stay grumpy for the first half of the mall trip, have one turning point where she sees the shivering dogs or the snow, and then move into full acceptance.",
    "bible_conflict": false
  }
]